nrfconnect/sdk-nrf/subsys/mpsl/fem/hot_potato/psemi/mpsl_fem_psemi_nrf54l.c
/* Copyright (c) 2024, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 *   1. Redistributions of source code must retain the above copyright notice, this
 *      list of conditions and the following disclaimer.
 *
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *
 *   3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *      contributors may be used to endorse or promote products derived from
 *      this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

/**
 * @file
 *   This file implements Front End Module control. It applies to nRF54 devices.
 */

/*
 * <event> is of mpsl_subscribable_hw_event_t type, it is a dppi already, so notation
 * <event>.dppi is used below. Arrows point from event's PUBLISH/task's SUBSCRIBE registers
 * to dppi channel.
 *
 * <abort_event> is of mpsl_subscribable_hw_event_t and is set by fem_simple_gpio_abort_set
 * function. On diagrams below `group` parameter of fem_simple_gpio_abort_set is ignored (not
 * supported).
 *
 * TIMER's CC numbers denoted by letters CC[a], CC[b] are not particular.
 *
 * GPIOTE[n].TASK_<on> is GPIOTE n-th channel's task to make given pin "active". What means
 * "active" for a given pin depends on `mpsl_fem_gpiote_pin_config_t::active_high` setting.
 *
 * 1) RXEN activation on TIMER, deactivation on <event> (<abort_event> not set):
 * Covers following sequence of configuration:
 *     - mpsl_fem_lna_configuration_set( "on timer", "on event `event`")
 *
 * Notes: Used in SD controller.
 *
 * Connections:
 * TIMER.CC[a] ---------------------------------> dppi0 <-- GPIOTE[pin_rxen].TASK_<on>
 *
 * <event>.dppi <------------------------------------------ GPIOTE[pin_rxen].TASK_<off>
 *
 * 2) TXEN activation on TIMER, deactivation on <event> (<abort_event> not set):
 * Covers following sequence of configuration:
 *     - mpsl_fem_pa_configuration_set( "on timer", "on event `event`")
 *
 * Notes: Used in SD controller.
 *
 * Connections:
 * TIMER.CC[a] ---------------------------------> dppi0 <-- GPIOTE[pin_txen].TASK_<on>
 *
 * <event>.dppi <------------------------------------------ GPIOTE[pin_txen].TASK_<off>
 *
 * 3.a) RXEN and TXEN deactivation on <abort_event> only:
 * Covers following sequence of configuration:
 *     - mpsl_fem_abort_set( "on `abort_event`", group=ignore)
 *
 * Notes: Used in nRF 802.15.4 Radio Driver. Connections-2 are considered optimal,
 * however this configuration is only temporary, and after additional calls
 * GPIOTE[pin_rxen].TASK_<off> will have multiple sources. Thus egu is used.
 * This egu is visible in other configurations as well.
 *
 * Connections:
 * <abort_event>.dppi <---+---- egu1 ---> dppi1 <-- GPIOTE[pin_rxen].TASK_<off>
 *                        |
 *                        +------------------------ GPIOTE[pin_txen].TASK_<off>
 *
 * Connections-2:
 * <abort_event>.dppi <---+------------------------ GPIOTE[pin_rxen].TASK_<off>
 *                        |
 *                        +------------------------ GPIOTE[pin_txen].TASK_<off>
 *
 * 3.b) RXEN activation on TIMER, deactivation on <abort_event> only
 * Covers following sequence of configuration:
 *     - mpsl_fem_abort_set( "on `abort_event`", group=ignore)
 *     - mpsl_fem_lna_configuration_set( "on timer", NULL)
 *
 * Notes: Used in nRF 802.15.4 Radio Driver, receive operation.
 *
 * Connections:
 * TIMER.CC[a] ---------------------------------> dppi0 <-- GPIOTE[pin_rxen].TASK_<on>
 *
 * <abort_event>.dppi <---+------------ egu1 ---> dppi1 <-- GPIOTE[pin_rxen].TASK_<off>
 *                        |
 *                        +-------------------------------- GPIOTE[pin_txen].TASK_<off>
 *
 * 3.c) RXEN activation on TIMER, deactivation on <event> or <abort_event>:
 * Covers following sequence of configuration:
 *     - mpsl_fem_abort_set( "on `abort_event`", group=ignore)
 *     - mpsl_fem_lna_configuration_set( "on timer", "on event `event`")
 *
 * Notes: Used in nRF 802.15.4 Radio Driver as intermediate step to achieve case 3.f)
 *
 * Connections:
 * TIMER.CC[a] ---------------------------------> dppi0 <-- GPIOTE[pin_rxen].TASK_<on>
 *
 * <event>.dppi <------------- egu0 --------+---> dppi1 <-- GPIOTE[pin_rxen].TASK_<off>
 *                                          |
 * <abort_event>.dppi <---+--- egu1 --------+
 *                        |
 *                        +-------------------------------- GPIOTE[pin_txen].TASK_<off>
 *
 * 3.d) TXEN activation on TIMER, deactivation on <abort_event> only
 * Covers following sequence of configuration:
 *     - mpsl_fem_abort_set( "on `abort_event`", group=ignore)
 *     - mpsl_fem_pa_configuration_set( "on timer", NULL )
 *
 * Notes: Used in nRF 802.15.4 Radio Driver, transmit operation.
 *
 * Connections:
 * TIMER.CC[a] ---------------------------------> dppi0 <-- GPIOTE[pin_txen].TASK_<on>
 *
 * <abort_event>.dppi <---+-------------------------------- GPIOTE[pin_txen].TASK_<off>
 *                        |
 *                        +------------ egu1 ---> dppi1 <-- GPIOTE[pin_rxen].TASK_<off>
 *
 * 3.e) TXEN activation on TIMER, deactivation on <event> or <abort_event>:
 * Covers following sequence of configuration:
 *     - mpsl_fem_abort_set( "on `abort_event`", group=ignore)
 *     - mpsl_fem_pa_configuration_set( "on timer", "on event")
 *
 * Notes: Not used
 *
 * 3.f) RXEN activation on TIMER, deactivation on <event> or <abort_event>,
 *      TXEN activation on <event> (the same as RXEN deactivation) deactivation on <abort_event>
 *      only.
 *     - mpsl_fem_abort_set( "on `abort_event`", group=ignore)
 *     - mpsl_fem_lna_configuration_set( "on timer", "on event `event`")
 *     - mpsl_fem_pa_configuration_set( "on event `event`", NULL)
 *
 * Connections:
 * TIMER.CC[a] ---------------------------------> dppi0 <-- GPIOTE[pin_rxen].TASK_<on>
 *
 * <event>.dppi <-----------+--- egu0 -----+----> dppi1 <-- GPIOTE[pin_rxen].TASK_<off>
 *                          |              |
 * <abort_event>.dppi <--+--|--- egu1 -----+
 *                       |  |
 *                       |  +----egu2 ----------> dppi2 <-- GPIOTE[pin_txen].TASK_<on>
 *                       |
 *                       +--------------------------------- GPIOTE[pin_txen].TASK_<off>
 */

#include "nrf.h"
#include "nrf_radio.h"
#include "nrf_regulators.h"

#include "mpsl_fem_abstract_interface.h"
#include "mpsl_fem_pins_common.h"
#include "mpsl_fem_psemi.h"
#include "mpsl_fem_psemi_common.h"

#include "hot_potato_callbacks.h"

#ifdef DPPIC_PRESENT

