nrfconnect/sdk-nrf/subsys/mpsl/fem/hot_potato/psemi/mpsl_fem_psemi_nrf54l.c
#include "nrf_dppi.h"
#if defined(__GNUC__) && !defined(_lint)
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-parameter"
#include "nrf_egu.h"
#pragma GCC diagnostic pop
#else
#include "nrf_egu.h"
#endif
#include "nrf_timer.h"

#define ASSERT_FILE_ID 114
#include "mpsl_assert.h"

extern uint8_t mpsl_fem_utils_available_cc_channel_get(uint8_t mask, uint32_t number);
extern mpsl_fem_psemi_t m_psemi_config;

#define M_EGU0 (m_psemi_config.egu_channels[0])
#define M_EGU1 (m_psemi_config.egu_channels[1])
#define M_EGU2 (m_psemi_config.egu_channels[2])

#define M_DPPI0 (m_psemi_config.dppi_channels[0])
#define M_DPPI1 (m_psemi_config.dppi_channels[1])
#define M_DPPI2 (m_psemi_config.dppi_channels[2])

static bool m_abort_event_is_set;

/** Holders for events provided by the @ref mpsl_fem_pa_configuration_set */
static const mpsl_fem_event_t *mp_pa_activate_event = NULL;
static const mpsl_fem_event_t *mp_pa_deactivate_event = NULL;

/** Holders for events provided by the @ref mpsl_fem_lna_configuration_set */
/** LNA is deactivated by NRF_802154_DPPI_RADIO_DISABLED dppi set by mpsl_fem_abort_set. */
static const mpsl_fem_event_t *mp_lna_activate_event = NULL;
static const mpsl_fem_event_t *mp_lna_deactivate_event = NULL;

static bool m_switched_to_ldo;

static void fem_psemi_enable(void);
static int32_t fem_psemi_disable(void);
static int32_t fem_psemi_pa_configuration_set(const mpsl_fem_event_t *const p_activate_event,
					      const mpsl_fem_event_t *const p_deactivate_event);
static int32_t fem_psemi_lna_configuration_set(const mpsl_fem_event_t *const p_activate_event,
					       const mpsl_fem_event_t *const p_deactivate_event);
static int32_t fem_psemi_pa_configuration_clear(void);
static int32_t fem_psemi_lna_configuration_clear(void);
static void fem_psemi_deactivate_now(mpsl_fem_functionality_t type);
static void fem_psemi_cleanup(void);
static void fem_psemi_lna_check_is_configured(int8_t *const p_gain);
static int32_t fem_psemi_abort_set(mpsl_subscribable_hw_event_t event, uint32_t group);
static int32_t fem_psemi_abort_extend(uint32_t channel_to_add, uint32_t group);
static int32_t fem_psemi_abort_reduce(uint32_t channel_to_remove, uint32_t group);
static int32_t fem_psemi_abort_clear(void);

static const mpsl_fem_interface_t m_fem_psemi_methods = {
	.p_caps_get = fem_psemi_caps_get,
	.p_enable = fem_psemi_enable,
	.p_disable = fem_psemi_disable,
	.p_tx_power_split = fem_psemi_tx_power_split,
	.p_pa_configuration_set = fem_psemi_pa_configuration_set,
	.p_lna_configuration_set = fem_psemi_lna_configuration_set,
	.p_pa_configuration_clear = fem_psemi_pa_configuration_clear,
	.p_lna_configuration_clear = fem_psemi_lna_configuration_clear,
	.p_deactivate_now = fem_psemi_deactivate_now,
	.p_cleanup = fem_psemi_cleanup,
	.p_pa_power_control_set = fem_psemi_pa_power_control_set,
	.p_lna_is_configured = fem_psemi_lna_check_is_configured,
	.p_abort_set = fem_psemi_abort_set,
	.p_abort_extend = fem_psemi_abort_extend,
	.p_abort_reduce = fem_psemi_abort_reduce,
	.p_abort_clear = fem_psemi_abort_clear,
};

static void fem_psemi_enable(void)
{
}

static void activation_on_timer_set(const mpsl_fem_event_t *const p_event,
				    mpsl_fem_task_t *p_pin_task, uint8_t dppi_ch,
				    uint32_t time_delay, uint32_t v_cc_no)
{
	if (mpsl_fem_task_is_valid(p_pin_task)) {
		uint32_t cc_no = mpsl_fem_utils_available_cc_channel_get(
			p_event->event.timer.compare_channel_mask, v_cc_no);
		MPSL_ASSERT(cc_no != UINT8_MAX);

		nrf_timer_publish_set(p_event->event.timer.p_timer_instance,
				      nrf_timer_compare_event_get((uint8_t)cc_no), dppi_ch);
		mpsl_fem_task_subscribe_set(p_pin_task, dppi_ch);

		/* Start with the smallest robustly triggered target time. */
		uint32_t target_time = 1;
		if (p_event->event.timer.counter_period.end > time_delay) {
			/* Update target time so that the activation finishes exactly
			 * at the end of the specified period. */
			target_time = p_event->event.timer.counter_period.end - time_delay;
		}

		nrf_timer_cc_set(p_event->event.timer.p_timer_instance,
				 (nrf_timer_cc_channel_t)cc_no, target_time);

		nrf_dppi_channels_enable(MPSL_NRF_DPPIC, 1U << dppi_ch);
	}
}

static void activation_on_timer_clear(const mpsl_fem_event_t *const p_event,
				      mpsl_fem_task_t *p_pin_task, uint8_t dppi_ch,
				      uint32_t v_cc_no)
{
	if (mpsl_fem_task_is_valid(p_pin_task)) {
		nrf_dppi_channels_disable(MPSL_NRF_DPPIC, (1U << dppi_ch));

		uint32_t cc_no = mpsl_fem_utils_available_cc_channel_get(
			p_event->event.timer.compare_channel_mask, v_cc_no);
		MPSL_ASSERT(cc_no != UINT8_MAX);

		mpsl_fem_task_subscribe_clear(p_pin_task);

		nrf_timer_publish_clear(p_event->event.timer.p_timer_instance,
					nrf_timer_compare_event_get((uint8_t)cc_no));
	}
}

static int32_t fem_psemi_disable(void)
{
	if (mp_pa_activate_event || mp_pa_deactivate_event || mp_lna_activate_event ||
	    mp_lna_deactivate_event) {
		// Actions on PA/LNA pins are still configured. Cannot disable
		return -NRF_EPERM;
	}

	return 0;
}

static int32_t pa_activation_on_generic_set(const mpsl_fem_event_t *const p_event,
					    mpsl_fem_psemi_t *p_obj)
{
	if (!mpsl_fem_gpiote_pin_is_enabled(&p_obj->pa_gpiote_pin)) {
		return -NRF_EPERM;
	}

	if (!mpsl_fem_task_is_valid(&p_obj->pa_task[1])) {
		return -NRF_EPERM;
	}

	// Case 3.f) of the doc
	nrf_egu_subscribe_set(MPSL_NRF_EGU, nrf_egu_trigger_task_get(M_EGU2),
			      p_event->event.generic.event);
	nrf_egu_publish_set(MPSL_NRF_EGU, nrf_egu_triggered_event_get(M_EGU2), M_DPPI2);
	mpsl_fem_task_subscribe_set(&p_obj->pa_task[1], M_DPPI2);

	nrf_dppi_channels_enable(MPSL_NRF_DPPIC, (1U << M_DPPI2));

	return 0;
}

static void pa_activation_on_generic_clear(mpsl_fem_psemi_t *p_obj)
{
	if (!mpsl_fem_gpiote_pin_is_enabled(&p_obj->pa_gpiote_pin)) {
		return;
	}

	if (!mpsl_fem_task_is_valid(&p_obj->pa_task[1])) {
		return;
	}

	nrf_dppi_channels_disable(MPSL_NRF_DPPIC, (1U << M_DPPI2));

	mpsl_fem_task_subscribe_clear(&p_obj->pa_task[1]);

	nrf_egu_publish_clear(MPSL_NRF_EGU, nrf_egu_triggered_event_get(M_EGU2));

