nrfconnect/sdk-nrf/subsys/mpsl/fem/hot_potato/psemi/mpsl_fem_psemi_nrf54l.c
	nrf_egu_subscribe_clear(MPSL_NRF_EGU, nrf_egu_trigger_task_get(M_EGU2));
}

static int32_t deactivation_on_generic_set(const mpsl_fem_event_t *const p_event,
					   mpsl_fem_task_t *p_pin_task,
					   mpsl_fem_psemi_t *p_obj)
{
	if (!mpsl_fem_task_is_valid(p_pin_task)) {
		return -NRF_EPERM;
	}

	if (m_abort_event_is_set) {
		if (p_pin_task == &p_obj->lna_task[0]) {
			// Case 3.c) 3.f)
			/* After fem_simple_gpio_abort_set is called, following holds:
			 * gpiote_task is subscribed to M_DPPI1
			 * M_DPPI1 is enabled
			 * Any number of tasks can publish to M_DPPI1 to trigger gpiote_task
			 */
			nrf_egu_subscribe_set(MPSL_NRF_EGU, nrf_egu_trigger_task_get(M_EGU0),
					      p_event->event.generic.event);
			nrf_egu_publish_set(MPSL_NRF_EGU, nrf_egu_triggered_event_get(M_EGU0),
					    M_DPPI1);
		} else {
			// Other cases, including 3.e) not supported, would require additional egu
			return -NRF_EINVAL;
		}

	} else {
		// Case 1) 2) of the doc.
		mpsl_fem_task_subscribe_set(p_pin_task, p_event->event.generic.event);
	}

	return 0;
}

static void deactivation_on_generic_clear(mpsl_fem_task_t *p_pin_task,
					  mpsl_fem_psemi_t *p_obj)
{
	if (!mpsl_fem_task_is_valid(p_pin_task)) {
		return;
	}

	if (m_abort_event_is_set) {
		if (p_pin_task == &p_obj->lna_task[0]) {
			// Case 3.c) 3.f)
			nrf_egu_publish_clear(MPSL_NRF_EGU, nrf_egu_triggered_event_get(M_EGU0));
			nrf_egu_subscribe_clear(MPSL_NRF_EGU, nrf_egu_trigger_task_get(M_EGU0));
		} else {
			// Other cases unsupported, more egu would be needed
		}
	} else {
		// Case 1) 2) of the doc.
		mpsl_fem_task_subscribe_clear(p_pin_task);
	}
}

static int32_t fem_psemi_pa_configuration_set(const mpsl_fem_event_t *const p_activate_event,
					      const mpsl_fem_event_t *const p_deactivate_event)
{
	mpsl_fem_psemi_t *p_obj = &m_psemi_config;
	int32_t ret_val = 0;
	/*
	 * When the bypass for BLE is enabled, and the radio has been configured to use a BLE PHY,
	 * put FEM in the bypass mode by asserting both PA & LNA pins.
	 */
	bool bypass = m_psemi_config.bypass_ble_enabled &&
		      nrf_radio_mode_get(NRF_RADIO) != NRF_RADIO_MODE_IEEE802154_250KBIT;
	bool is_802154 = nrf_radio_mode_get(NRF_RADIO) == NRF_RADIO_MODE_IEEE802154_250KBIT;
	bool switch_to_ldo = m_psemi_config.pa_ldo_switch_enabled && is_802154 &&
			nrf_regulators_vreg_enable_check(NRF_REGULATORS, NRF_REGULATORS_VREG_MAIN);

	if (switch_to_ldo) {
		nrf_regulators_vreg_enable_set(NRF_REGULATORS, NRF_REGULATORS_VREG_MAIN, false);
		m_switched_to_ldo = true;
	}

	VendorUsageCpuMeasureBegin();

	if (mpsl_fem_psemi_state_get() != FEM_PSEMI_STATE_AUTO) {
		return -NRF_EPERM;
	}

	if (p_activate_event != NULL) {
		switch (p_activate_event->type) {
		case MPSL_FEM_EVENT_TYPE_TIMER:
			activation_on_timer_set(p_activate_event, &p_obj->pa_task[1], M_DPPI0,
						m_psemi_config.fem_config.pa_time_gap_us,
						0);

			if (bypass) {
				activation_on_timer_set(
					p_activate_event, &p_obj->lna_task[1], M_DPPI0,
					m_psemi_config.fem_config.pa_time_gap_us, 0);
			}
			break;

		case MPSL_FEM_EVENT_TYPE_GENERIC:
			ret_val = pa_activation_on_generic_set(p_activate_event, p_obj);
			MPSL_ASSERT(!bypass);
			break;

		default:
			ret_val = -NRF_EINVAL;
			break;
		}

		if (ret_val != 0) {
			return ret_val;
		}

		mp_pa_activate_event = p_activate_event;
	}

	if (p_deactivate_event != NULL) {
		switch (p_deactivate_event->type) {
		case MPSL_FEM_EVENT_TYPE_GENERIC:
			ret_val = deactivation_on_generic_set(p_deactivate_event,
							      &p_obj->pa_task[0], p_obj);

			if (bypass && ret_val == 0) {
				ret_val = deactivation_on_generic_set(p_deactivate_event,
								      &p_obj->lna_task[0], p_obj);
			}
			break;

		default:
			ret_val = -NRF_EINVAL;
			break;
		}

		if (ret_val != 0) {
			return ret_val;
		}

		mp_pa_deactivate_event = p_deactivate_event;
	}

	return 0;
}

static int32_t fem_psemi_lna_configuration_set(const mpsl_fem_event_t *const p_activate_event,
					       const mpsl_fem_event_t *const p_deactivate_event)
{
	mpsl_fem_psemi_t *p_obj = &m_psemi_config;
	int32_t ret_val = 0;
	/*
	 * When the bypass for BLE is enabled, and the radio has been configured to use a BLE PHY,
	 * put FEM in the bypass mode by asserting both PA & LNA pins.
	 */
	bool bypass = m_psemi_config.bypass_ble_enabled &&
		      nrf_radio_mode_get(NRF_RADIO) != NRF_RADIO_MODE_IEEE802154_250KBIT;

	if (mpsl_fem_psemi_state_get() != FEM_PSEMI_STATE_AUTO) {
		return -NRF_EPERM;
	}

	if (p_activate_event != NULL) {
		switch (p_activate_event->type) {
		case MPSL_FEM_EVENT_TYPE_TIMER:
			activation_on_timer_set(p_activate_event, &p_obj->lna_task[1], M_DPPI0,
						m_psemi_config.fem_config.lna_time_gap_us,
						0);

			if (bypass) {
				activation_on_timer_set(
					p_activate_event, &p_obj->pa_task[1], M_DPPI0,
					m_psemi_config.fem_config.lna_time_gap_us, 0);
			}
			break;

		case MPSL_FEM_EVENT_TYPE_GENERIC:
			/* There is no support for lna activation by event */
			/* fallthrough */
		default:
			ret_val = -NRF_EINVAL;
			break;
		}

		if (ret_val != 0) {
			return ret_val;
		}

		mp_lna_activate_event = p_activate_event;
	}

	if (p_deactivate_event != NULL) {
		switch (p_deactivate_event->type) {
		case MPSL_FEM_EVENT_TYPE_GENERIC:
			ret_val = deactivation_on_generic_set(p_deactivate_event,
							      &p_obj->lna_task[0], p_obj);

			if (bypass && ret_val == 0) {
				ret_val = deactivation_on_generic_set(p_deactivate_event,
								      &p_obj->pa_task[0], p_obj);
			}
			break;

		case MPSL_FEM_EVENT_TYPE_TIMER:
			/* There is no support for lna deactivation by timer */
			/* fallthrough */

		default:
			ret_val = -NRF_EINVAL;
			break;
		}

		if (ret_val != 0) {

			return ret_val;
		}

		mp_lna_deactivate_event = p_deactivate_event;
	}

	return 0;
}

static int32_t fem_psemi_pa_configuration_clear(void)
{
	mpsl_fem_psemi_t *p_obj = &m_psemi_config;
	/*
	 * When the bypass for BLE is enabled, and the radio has been configured to use a BLE PHY,
	 * put FEM in the bypass mode by asserting both PA & LNA pins.
	 */
	bool bypass = m_psemi_config.bypass_ble_enabled &&
		      nrf_radio_mode_get(NRF_RADIO) != NRF_RADIO_MODE_IEEE802154_250KBIT;

	VendorUsageCpuMeasureEnd();

	if (m_switched_to_ldo) {
		nrf_regulators_vreg_enable_set(NRF_REGULATORS, NRF_REGULATORS_VREG_MAIN, true);
		m_switched_to_ldo = false;
	}

	if (mpsl_fem_psemi_state_get() != FEM_PSEMI_STATE_AUTO) {
		return -NRF_EPERM;
	}

	fem_psemi_pa_gain_default(p_obj);

	if (mp_pa_activate_event != NULL) {
		switch (mp_pa_activate_event->type) {
		case MPSL_FEM_EVENT_TYPE_TIMER:
			activation_on_timer_clear(mp_pa_activate_event, &p_obj->pa_task[1], M_DPPI0,
						  0);

			if (bypass) {
				activation_on_timer_clear(mp_pa_activate_event, &p_obj->lna_task[1],
							  M_DPPI0, 0);
			}
			break;

		case MPSL_FEM_EVENT_TYPE_GENERIC:
			pa_activation_on_generic_clear(p_obj);
			MPSL_ASSERT(!bypass);
			break;

		default:
			MPSL_ASSERT(false);
			return -NRF_EINVAL;
		}

		mp_pa_activate_event = NULL;
	}

	if (mp_pa_deactivate_event != NULL) {
		switch (mp_pa_deactivate_event->type) {
		case MPSL_FEM_EVENT_TYPE_GENERIC:
			deactivation_on_generic_clear(&p_obj->pa_task[0], p_obj);

			if (bypass) {
				deactivation_on_generic_clear(&p_obj->lna_task[0], p_obj);
			}
			break;
		default:
			MPSL_ASSERT(false);
			return -NRF_EINVAL;
		}
		mp_pa_deactivate_event = NULL;
	}

