nrfconnect/sdk-nrf/subsys/mpsl/fem/hot_potato/psemi/mpsl_fem_psemi_nrf54l.c
	return 0;
}

static int32_t fem_psemi_lna_configuration_clear(void)
{
	mpsl_fem_psemi_t *p_obj = &m_psemi_config;
	/*
	 * When the bypass for BLE is enabled, and the radio has been configured to use a BLE PHY,
	 * put FEM in the bypass mode by asserting both PA & LNA pins.
	 */
	bool bypass = m_psemi_config.bypass_ble_enabled &&
		      nrf_radio_mode_get(NRF_RADIO) != NRF_RADIO_MODE_IEEE802154_250KBIT;

	if (mpsl_fem_psemi_state_get() != FEM_PSEMI_STATE_AUTO) {
		return -NRF_EPERM;
	}

	if (mp_lna_activate_event != NULL) {
		switch (mp_lna_activate_event->type) {
		case MPSL_FEM_EVENT_TYPE_TIMER:
			activation_on_timer_clear(mp_lna_activate_event, &p_obj->lna_task[1],
						  M_DPPI0, 0);

			if (bypass) {
				activation_on_timer_clear(mp_lna_activate_event, &p_obj->pa_task[1],
							  M_DPPI0, 0);
			}
			break;

		case MPSL_FEM_EVENT_TYPE_GENERIC:
			/* There is no support for lna activation by event, so it should
			 * not be possible to save such event into mp_lna_activate_event.
			 */
			/* fallthrough */
		default:
			MPSL_ASSERT(false);
			return -NRF_EINVAL;
		}

		mp_lna_activate_event = NULL;
	}

	if (mp_lna_deactivate_event != NULL) {
		switch (mp_lna_deactivate_event->type) {
		case MPSL_FEM_EVENT_TYPE_GENERIC:
			deactivation_on_generic_clear(&p_obj->lna_task[0], p_obj);

			if (bypass) {
				deactivation_on_generic_clear(&p_obj->pa_task[0], p_obj);
			}
			break;
		default:
			MPSL_ASSERT(false);
			return -NRF_EINVAL;
		}
		mp_lna_deactivate_event = NULL;
	}

	return 0;
}

static void fem_psemi_deactivate_now(mpsl_fem_functionality_t type)
{
	if (mpsl_fem_psemi_state_get() != FEM_PSEMI_STATE_AUTO) {
		return;
	}

	if (mpsl_fem_gpiote_pin_is_enabled(&m_psemi_config.pa_gpiote_pin) && (type & MPSL_FEM_PA)) {
		mpsl_fem_gpiote_pin_output_active_write(&m_psemi_config.pa_gpiote_pin, false);
	}

	if (mpsl_fem_gpiote_pin_is_enabled(&m_psemi_config.lna_gpiote_pin) && (type & MPSL_FEM_LNA)) {
		mpsl_fem_gpiote_pin_output_active_write(&m_psemi_config.lna_gpiote_pin, false);
	}
}

static int32_t fem_psemi_soc_init(mpsl_fem_psemi_t *p_obj)
{
	if (mpsl_fem_gpiote_pin_is_enabled(&p_obj->pa_gpiote_pin)) {
		if (!mpsl_fem_task_init(
			    &p_obj->pa_task[0],
			    mpsl_fem_gpiote_pin_action_task_address_get(&p_obj->pa_gpiote_pin, false),
			    (uintptr_t)MPSL_NRF_DPPIC)) {
			return -NRF_ENOMEM;
		}

		if (!mpsl_fem_task_init(
			    &p_obj->pa_task[1],
			    mpsl_fem_gpiote_pin_action_task_address_get(&p_obj->pa_gpiote_pin, true),
			    (uintptr_t)MPSL_NRF_DPPIC)) {
			return -NRF_ENOMEM;
		}
	} else {
		(void)mpsl_fem_task_init(&p_obj->pa_task[0], 0U, 0U);
		(void)mpsl_fem_task_init(&p_obj->pa_task[1], 0U, 0U);
	}

	if (mpsl_fem_gpiote_pin_is_enabled(&p_obj->lna_gpiote_pin)) {
		if (!mpsl_fem_task_init(
			    &p_obj->lna_task[0],
			    mpsl_fem_gpiote_pin_action_task_address_get(&p_obj->lna_gpiote_pin, false),
			    (uintptr_t)MPSL_NRF_DPPIC)) {
			return -NRF_ENOMEM;
		}

		if (!mpsl_fem_task_init(
			    &p_obj->lna_task[1],
			    mpsl_fem_gpiote_pin_action_task_address_get(&p_obj->lna_gpiote_pin, true),
			    (uintptr_t)MPSL_NRF_DPPIC)) {
			return -NRF_ENOMEM;
		}
	} else {
		(void)mpsl_fem_task_init(&p_obj->lna_task[0], 0U, 0U);
		(void)mpsl_fem_task_init(&p_obj->lna_task[1], 0U, 0U);
	}

	return 0;
}

int32_t mpsl_fem_psemi_interface_config_set(mpsl_fem_psemi_interface_config_t const *const p_config)
{
	int32_t ret_code;

	m_psemi_config.fem_config.pa_time_gap_us = p_config->fem_config.pa_time_gap_us;
	m_psemi_config.fem_config.lna_time_gap_us = p_config->fem_config.lna_time_gap_us;
	m_psemi_config.fem_config.lna_gain_db = p_config->fem_config.lna_gain_db;
	m_psemi_config.bypass_ble_enabled = p_config->bypass_ble_enabled;
	m_psemi_config.pa_ldo_switch_enabled = p_config->pa_ldo_switch_enabled;
	m_psemi_config.egu_instance_no = p_config->egu_instance_no;
	memcpy(m_psemi_config.att_pins, p_config->att_pins, sizeof(m_psemi_config.att_pins));
	memcpy(m_psemi_config.dppi_channels, p_config->dppi_channels,
	       sizeof(m_psemi_config.dppi_channels));
	memcpy(m_psemi_config.egu_channels, p_config->egu_channels,
	       sizeof(m_psemi_config.egu_channels));

	mpsl_fem_gpiote_pin_init(&m_psemi_config.pa_gpiote_pin, &p_config->pa_pin_config);
	mpsl_fem_gpiote_pin_init(&m_psemi_config.lna_gpiote_pin, &p_config->lna_pin_config);

	fem_psemi_gain_gpio_configure(&m_psemi_config);
	
	ret_code = fem_psemi_soc_init(&m_psemi_config);
	if (ret_code != 0) {
		return ret_code;
	}

	ret_code = mpsl_fem_interface_set(&m_fem_psemi_methods);

	if (ret_code != 0) {
		return ret_code;
	}

	return 0;
}

static void fem_psemi_cleanup(void)
{
	(void)fem_psemi_pa_configuration_clear();
	(void)fem_psemi_lna_configuration_clear();
	(void)fem_psemi_abort_clear();
}

static int32_t fem_psemi_abort_set(mpsl_subscribable_hw_event_t event, uint32_t group)
{
	// Case 3.a) of the doc.

	mpsl_fem_psemi_t *p_obj = &m_psemi_config;

	(void)group;

	if ((mp_pa_activate_event != NULL) || (mp_lna_activate_event != NULL)) {
		return -NRF_EINVAL;
	}

	if (mpsl_fem_psemi_state_get() != FEM_PSEMI_STATE_AUTO) {
		return -NRF_EPERM;
	}

	if (mpsl_fem_task_is_valid(&p_obj->lna_task[0])) {
		nrf_egu_subscribe_set(MPSL_NRF_EGU, nrf_egu_trigger_task_get(M_EGU1), event);
		nrf_egu_publish_set(MPSL_NRF_EGU, nrf_egu_triggered_event_get(M_EGU1), M_DPPI1);
		mpsl_fem_task_subscribe_set(&p_obj->lna_task[0], M_DPPI1);
		nrf_dppi_channels_enable(MPSL_NRF_DPPIC, (1U << M_DPPI1));
	}

	if (mpsl_fem_task_is_valid(&p_obj->pa_task[0])) {
		mpsl_fem_task_subscribe_set(&p_obj->pa_task[0], event);
	}

	m_abort_event_is_set = true;

	return 0;
}

static int32_t fem_psemi_abort_extend(uint32_t channel_to_add, uint32_t group)
{
	(void)channel_to_add;
	(void)group;
	/* in this Front End Module implementation dont have to do anything here */
	return 0;
}

static int32_t fem_psemi_abort_reduce(uint32_t channel_to_remove, uint32_t group)
{
	(void)channel_to_remove;
	(void)group;
	/* in this Front End Module implementation dont have to do anything here */
	return 0;
}

static int32_t fem_psemi_abort_clear(void)
{
	mpsl_fem_psemi_t *p_obj = &m_psemi_config;

	if (!m_abort_event_is_set) {
		// There's nothing to clear.
		return -NRF_EPERM;
	}

	if (mpsl_fem_psemi_state_get() != FEM_PSEMI_STATE_AUTO) {
		return -NRF_EPERM;
	}

	if (mpsl_fem_task_is_valid(&p_obj->lna_task[0])) {
		nrf_dppi_channels_disable(MPSL_NRF_DPPIC, (1U << M_DPPI1));
		mpsl_fem_task_subscribe_clear(&p_obj->lna_task[0]);
		nrf_egu_publish_clear(MPSL_NRF_EGU, nrf_egu_triggered_event_get(M_EGU1));
		nrf_egu_subscribe_clear(MPSL_NRF_EGU, nrf_egu_trigger_task_get(M_EGU1));
	}
	if (mpsl_fem_task_is_valid(&p_obj->pa_task[0])) {
		mpsl_fem_task_subscribe_clear(&p_obj->pa_task[0]);
	}

	m_abort_event_is_set = false;

	return 0;
}

static void fem_psemi_lna_check_is_configured(int8_t *const p_gain)
{
	*p_gain = m_psemi_config.fem_config.lna_gain_db;
}

#endif //DPPIC_PRESENT